In [282]:
import pandas as pd

In [283]:
df = pd.read_csv("supershops.csv")
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [284]:
x = df.drop('Profit', axis=1)

In [285]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [286]:
y = df['Profit']

In [287]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

In [288]:
x2= x.copy()
x3= x.copy()
x4= x.copy()
x5= x.copy()
x2.head()
x3.head()
x4.head()
x5.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

# Normalization

In [289]:
from sklearn.preprocessing import MinMaxScaler

In [290]:
m = MinMaxScaler()

In [291]:
df_mar_sp = m.fit(x[['Marketing Spend']])
df_mar_sp

MinMaxScaler()

In [292]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [293]:
x['Marketing Spend'] = m.transform(x[["Marketing Spend"]])

In [294]:
x['Marketing Spend'].head()

0    0.692617
1    0.983359
2    0.927985
3    0.873136
4    0.859438
Name: Marketing Spend, dtype: float64

In [295]:
for column in x.columns:
    if pd.api.types.is_numeric_dtype(x[column]):
        x[column] = m.fit_transform(x[[column]])
    else:
        continue

In [296]:
x.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744   1.000000    Dhaka
1         0.983359        0.761972   0.940893      Ctg
2         0.927985        0.379579   0.864664  Rangpur
3         0.873136        0.512998   0.812235    Dhaka
4         0.859438        0.305328   0.776136  Rangpur

# Standarization

In [297]:
from sklearn.preprocessing import StandardScaler
m2 = StandardScaler()

In [298]:
for column in x2.columns:
    if pd.api.types.is_numeric_dtype(x2[column]):
        x2[[column]] = m2.fit_transform(x2[[column]])
    else:
        continue

In [299]:
x2.head()

   Marketing Spend  Administration  Transport     Area
0         0.897913        0.560753   2.165287    Dhaka
1         1.955860        1.082807   1.929843      Ctg
2         1.754364       -0.728257   1.626191  Rangpur
3         1.554784       -0.096365   1.417348    Dhaka
4         1.504937       -1.079919   1.273550  Rangpur

In [300]:
x2['Marketing Spend'].std()

1.0101525445522108

In [301]:
x2['Marketing Spend'].mean()

-7.549516567451065e-17

# Log Transformation

In [302]:
import numpy as np

In [303]:
x3.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [304]:
for column in x3.columns:
    if np.issubdtype(x3[column].dtype, np.number):
        x3[[column]] = np.log(x3[[column]])
    else:
        continue

C:\Users\asadu\AppData\Local\Programs\Python\Python311\Lib\site-packages\pandas\core\internals\blocks.py:329: RuntimeWarning: divide by zero encountered in log
  result = func(self.values, **kwargs)
C:\Users\asadu\AppData\Local\Programs\Python\Python311\Lib\site-packages\pandas\core\internals\blocks.py:329: RuntimeWarning: divide by zero encountered in log
  result = func(self.values, **kwargs)

In [305]:
x3.head()

   Marketing Spend  Administration  Transport     Area
0        11.648536       11.826990  13.064277    Dhaka
1        11.999034       11.927533  13.003351      Ctg
2        11.941075       11.524316  12.918862  Rangpur
3        11.880151       11.684117  12.856311    Dhaka
4        11.864338       11.422911  12.810849  Rangpur

# Robust Scaler

In [306]:
from sklearn.preprocessing import RobustScaler
m3 = RobustScaler()

In [307]:
x4.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [308]:
for column in x4.columns:
    if pd.api.types.is_numeric_dtype(x4[column]):
        x4[[column]] = m3.fit_transform(x4[[column]])
    else:
        continue

In [309]:
x4.head()

   Marketing Spend  Administration  Transport     Area
0         0.672530        0.345355   1.552016    Dhaka
1         1.452113        0.697565   1.383714      Ctg
2         1.303634       -0.524290   1.166654  Rangpur
3         1.156567       -0.097977   1.017368    Dhaka
4         1.119836       -0.761543   0.914576  Rangpur

# Max Absolute Scaler

In [310]:
from sklearn.preprocessing import MaxAbsScaler
m4 = MaxAbsScaler()

In [311]:
x5.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [312]:
for column in x5.columns:
    if pd.api.types.is_numeric_dtype(x5[column]):
        x5[[column]] = m4.fit_transform(x5[[column]])
    else:
        continue

In [313]:
x5.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.749527   1.000000    Dhaka
1         0.983359        0.828805   0.940893      Ctg
2         0.927985        0.553781   0.864664  Rangpur
3         0.873136        0.649738   0.812235    Dhaka
4         0.859438        0.500378   0.776136  Rangpur